#+BEGIN_SRC sh :export both
date
date +%c
Today=$(date +%F); echo $Today
Now=$(date +%Y-%m-%d-%H%M%S); echo $Now

#+END_SRC
#+RESULTS:
|               Thu | Nov |   7 | 18:20:06 |      JST | 2013 |     |
|               Thu |   7 | Nov |     2013 | 06:20:06 |   PM | JST |
|        2013-11-07 |     |     |          |          |      |     |
| 2013-11-07-182006 |     |     |          |          |      |     |


#+BEGIN_SRC sh :exports both
### Date note

date +%D ## 11/07/13   :Full date m%d%y%
date +%F ## 2013-11-07 :Full date Y%-m%-d% 
date +%x ## 11/07/2013 :Full local date m%d%Y%
date +%X ## 07:50:16 PM:Full local time 12Hour
date +%r ## 07:50:16 PM:Full time 12Hour
date +%R ## 19:50 :Time %H:%M
date +%T ## 19:50:40 :Full time 24Hour

date +%C ## 20   :Century
date +%Y ## 2013 :Year
date +%y ##   13 :Year
date +%G ## 2013 :ISO Year
date +%g ##   13 :ISO Year

date +%B ## November :Month
date +%b ## Nov :Month
date +%h ## Nov :Month
date +%m ## 11  :Month 01..12

date +%A ## Thursday :Weekday 
date +%a ## Thu :Weekday
date +%U ##  44 :Week of Year 00..53 1st day is Sun
date +%V ##  45 :ISO Week of Year 01..53 1st day is Mon
date +%W ##  45 :Week of Year 01..53 1st day is Mon

date +%d ##  7  :Day
date +%j ## 311 :Day of Year 
date +%_d##  7  :Day of Month
date +%e ##  7  :Day of Month
date +%u ##  4  :Day of week 1 is Monday 1..7
date +%w ##  4  :Day of week 0 is Sunday 0..6

date +%H ## 18  :Hour 00..23
date +%_H## 18  :Hour 00..23
date +%l ##  6  :Hour 1..12
date +%I ##  6  :Hour 1..12

date +%M ## 36  :Minutes 00..59

date +%S ##  5  :Seconds 00..59
date +%s ##    :Seconds since 1970-01-01 00:00:00 UTC
date +%N ##    :Nanoseconds(00000000.99999999)

date +%p ## AM, PM 
date +%P ## am, pm

date +%Z ## JST alphabetic time zone
date +%z ## +0900 numeric time zond
date +%:z ## +09:00 numeric time zone
date +%::z ## +09:00:00 numeric time zone
date +%:::z ## +09 numeric time zone
#+END_SRC
#+RESULTS:
|   11/07/13 |    |
| 2013-11-07 |    |
| 11/07/2013 |    |
|   08:13:48 | PM |
|   08:13:48 | PM |
|      20:13 |    |
|   20:13:48 |    |
|         20 |    |
|       2013 |    |
|         13 |    |
|       2013 |    |
|         13 |    |
|   November |    |
|        Nov |    |
|        Nov |    |
|         11 |    |
|   Thursday |    |
|        Thu |    |
|          4 |    |
|          4 |    |
|          7 |    |
|          7 |    |
|         20 |    |
|          8 |    |
|          8 |    |
|         13 |    |
|         48 |    |
|        311 |    |
|         44 |    |
|         45 |    |
|         44 |    |
| 1383822828 |    |
|  378747195 |    |
|         PM |    |
|         pm |    |
|        JST |    |
|      +0900 |    |
|     +09:00 |    |
|  +09:00:00 |    |
|        +09 |    |
